LtyIntegrationTest/LtyTransaction/src/test/resources/data/json/Request_LtyLookupLoyaltyDetail.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ent="http://www.macys.com/enterprise_services" xmlns:v12="http://loyalty.macys.com/schemas/loyalty.account/LtyAccountRequest/v12_0" xmlns:v121="http://loyalty.macys.com/schemas/loyalty.common/LtyCommon/v12_0">
   <soapenv:Header>
      <ent:requestor_info>
         <!--Optional:-->
         <version>12</version>
         <client_id>Stores</client_id>
         <subclient_id>SPOS</subclient_id>
      </ent:requestor_info>
   </soapenv:Header>
   <soapenv:Body>
      <v12:LtyLookupLoyaltyDetailReq>
         <v121:CommunicationHeader>
            <v121:Division>71</v121:Division>
            <v121:SourceApp>SPOS</v121:SourceApp>
            <v121:DeviceChannel>SPOS</v121:DeviceChannel>
            <!--Optional:-->
            <v121:Stt>
               <v121:Date>DynamicDate</v121:Date>
               <v121:Store>12</v121:Store>
               <v121:RegisterNum>13</v121:RegisterNum>
               <v121:SalesTransNum>SalesTransValue</v121:SalesTransNum>
               <v121:Division>71</v121:Division>
            </v121:Stt>
            <v121:AssociateId>12345</v121:AssociateId>
            <v121:LTYVersion>12</v121:LTYVersion>
         </v121:CommunicationHeader>
         <v121:CustomerIdentifier>
            <v121:AccountType>L</v121:AccountType>
            <v121:AccountNumber>DynamicAccountNumber</v121:AccountNumber>
         </v121:CustomerIdentifier>
      </v12:LtyLookupLoyaltyDetailReq>
   </soapenv:Body>
</soapenv:Envelope>